package cn.edu.henau.data_structure;

/**
 * Author: Qihao
 * Date: 2019/11/22  10:30
 * Content:
 * 数据结构: 栈
 * 数据存储的常用结构有:栈,队列,数组,链表和红黑树
 * 栈: 先进后出,入口和出口在同一侧都在栈顶
 *
 * 链表:
 *  查询慢:链表中的地址不是连续的,每次查询都需要从头开始查询
 *  增删快:链表结构,增删元素只影响一个节点
 *  链表中的一个元素也成为一个节点,一个节点包含了一个数据源(存储数据),两个指针域(存储地址)
 *          自己的地址   数据   下一个节点的地址
 *  链表的分类: 单向链表,双向链表
 *         单向链表:链表中只有一条链子,不能保证元素的顺序(存储元素和取出元素的顺序有可能不一致)
 *         双向链表:链表中有两条链子,有一条链子是专门记录元素的顺序,是一个有序的集合
 *
 *  排序树/查找树
 *  在二叉树的基础上,元素是有大小顺序的,左子树小,右子树大
 */
public class Stack {
}
